"""
Κύριο αρχείο εκκίνησης της εφαρμογής (Entry point).
Εδώ γίνεται η αρχικοποίηση του παιχνιδιού και της γραφικής διεπαφής.
"""

from window import TicTacToeWindow


def main():
    """
    Κύρια συνάρτηση που εκκινεί την εφαρμογή.
    Δημιουργεί αντικείμενα για το παιχνίδι, τους παίκτες και το παράθυρο.
    """

    # Δημιουργία του αντικειμένου της γραφικής διεπαφής (GUI)
    # Η κλάση TicTacToeWindow αναλαμβάνει εσωτερικά την αρχικοποίηση του παιχνιδιού
    window = TicTacToeWindow()

    # Εκκίνηση της εφαρμογής
    window.run()


if __name__ == "__main__":
    # Το check αυτό διασφαλίζει ότι το πρόγραμμα θα εκτελεστεί μόνο 
    # αν τρέξουμε το συγκεκριμένο αρχείο και όχι αν το κάνουμε import.
    main()
